--- a/README.md
+++ b/README.md
@@ -30,37 +47,36 @@ Several GUI helper tools are provided as examples of how to use the UDP and `sko
 
 * Signal flow per voice
 
+```mermaid
+%%{init:{'flowchart': {'nodePadding': 20},{'rankSpacing': 20}}}%%
+graph TD
+w(waveform)
+v(voice)
+f("frequency<br>&rarr;mod")
+c("phase distortion<br>&rarr;mod")
+h("sample & hold (down-sampling)")
+q("quantizer (bit-reduction)")
+J("multi-mode filter (LP/HP/BP/Notch/AP)")
+a("amplitude<br>&rarr;mod<br>ADSR&rarr;")
+X((mod))
+p("panner<br>&rarr;mod")
+v-->w;
+w-->f;
+f-->c;
+c-->h;
+h-->q;
+q-->J;
+J-->a;
+a-->X;
+X-->p;
+p-->L & R;
 ```
-┌─────────────┐
-│ Oscillator  │ ← Frequency Modulation (FM)
-└──────┬──────┘
-┌──────↓──────┐
-│    Phase    │ ← PD Modulation
-│ Distortion  │
-└──────┬──────┘
-┌──────↓──────┐
-│Sample & Hold│ (down-sampling)
-└──────┬──────┘
-┌──────↓──────┐
-│  Quantizer  │ (bit reduction)
-└──────┬──────┘
-┌──────↓──────┐
-│ Multi-Mode  │ (LP/HP/BP/Notch/AP filter)
-│   Filter    │
-└──────┬──────┘
-┌──────↓──────┐
-│  Amplitude  │ ← Amplitude Modulation (AM)
-│   Scaling   │ ← ADSR Envelope
-└──────┬──────┘ ← Velocity
-  ┌────↓────┐
-  │ sample  │ → to Modulation Destinations
-  └────┬────┘
-┌──────↓──────┐
-│   Panner    │ ← Pan Modulation
-└─────────────┘
-   ↓       ↓
-  [L]     [R]
-```
+
+## seq
+
